In [9]:
import pandas as pd
s1=pd.Series([1,2,5])
#series representation with index first then value
s1

0    1
1    2
2    5
dtype: int64

In [15]:
s2=pd.Series([1,2,3],index=['a:','b:','c:'])
s2

a:    1
b:    2
c:    3
dtype: int64

In [18]:
#creating dataframe
#method1
data={'Name':['Alex','Bob','rayu'],'Age':[27,24,22]}
df=pd.DataFrame(data)

df

   Name  Age
0  Alex   27
1   Bob   24
2  rayu   22

In [21]:
#method2
list_of_dicts=[{'column1':1,'column2':2,'column3':3},
              {'column1':4,'column2':5,'column3':6}]
df=pd.DataFrame(list_of_dicts)
df

   column1  column2  column3
0        1        2        3
1        4        5        6

In [22]:
list2=[{'column1':1,'column2':2,'column3':3},
              {'column1':4,'column2':5,'column3':6}]
df=pd.DataFrame(list2,index=['row1','row2'])
df

      column1  column2  column3
row1        1        2        3
row2        4        5        6

In [25]:
list_of_tuples=[(18,'rayu','2001'),(22,'thuva',2001),
               (6,'shathu',1998),(7,'dhoni',1985)]

df1=pd.DataFrame(list_of_tuples,columns=['Date','Name','Month'])

df1

   Date    Name Month
0    18    rayu  2001
1    22   thuva  2001
2     6  shathu  1998
3     7   dhoni  1985

In [27]:
students=['alice','bob','alan']

age=[24,23,21,25]

list_of_tuple2=list(zip(students,age))

df2=pd.DataFrame(list_of_tuple2,columns=['Name','Age'])

df2

    Name  Age
0  alice   24
1    bob   23
2   alan   21

In [32]:
print(df2.head())
print('##########')
print(df2.info())
print('##########')
print(df2.values())
print('##########')

    Name  Age
0  alice   24
1    bob   23
2   alan   21
##########
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes
None
##########

TypeError: 'numpy.ndarray' object is not callable